{"events": [
    {"start_date": {"year": "2015", "month": "9"},
    "text": {"headline": "Senior Business Intelligence Engineer",
    "text": "<p>In 2015 I was approached by the Manager of the Business Intelligence team and was offered a role as a Senior Business Intelligence Engineer.  Over the next 8 years I would become the SME in the 'Excellence'/survey development, data, processes and reporting.  I rewrote all reporting that was in Hyperion and moved it to Tableau and SSRS, this included creating new Tableau data sources and computed dimensions and measures.<p>"}},
    {"start_date": {"year": "2014", "month": "1"},
    "text": {"headline": "I was offered the role of Help Desk Manager",
    "text": "<p>In the role of Help Desk Manager I managed the day to day operations of the help desk and oversaw numerous large scale projects including 529 internal desk systems moves, 239 desktop replacements across the Americas, 220 Windows upgrades across the Americas, deployment of 170 thin clients in the call center, deployment of new tools: MalwareBytes, Symantec Ghost, improved processes, and created the first Help Desk reporting in Tableau. <p>"}},
    {"start_date": {"year": "2010", "month": "3"},
    "text": {"headline": "I was promoted to Director of IS Operations",
    "text": "<p>In the new role (for myself and the company) of Director of IS Operations, I was responsible for working with IS leaders to develop a process for the IS budget managment and reporting, contract maintenance, and weekly department KPI report out.<p>"}},
    {"start_date": {"year": "2008", "month": "9"},
    "text": {"headline": "New Role as an IS Project Manager", 
    "text": "In this role I expanded into project management and business analysis.  Working with several different application developers on several projects; including a project that would allow the source, reservation system, to access Lotus Notes applications and automate the generation of final travel documents."}},
    {"start_date": {"year": "1997", "month": "6"},
    "text":{"headline":"My introduction to Application Development with Lotus Notes",
    "text":"<p>Grand Circle adopted Lotus Notes for Email and with this the application development environment. Over the next 11 years I would earn 2 certifications, take 8 different classes, and develop numerous applications with embedded workflow that would remove many manual efforts and room for error.<p>"}},
    {"start_date": {"year": "1996", "month": "8"},
    "text": {"headline": "My introduction to Information Technology",
    "text": "<p>I was hired as the Executive Assistant to the CIO / Help Desk Associate<p>"}},
    {"start_date":{"year":"1993","month":"8"},
    "text":{"headline":"Hired by Grand Circle Travel",
    "text":"I was hired into an operations role and remained in operations for 3 years."}}
        
    ]}