{"events": [
    {"start_date": {"year": "2023", "month": "11"},
    "text": {"headline": "Crossing Training on everything I know",
    "text": "<p>I spent two months cross training another associate, and sometimes multiple people on the various aspects of my expertise and job responsibilities. <p>"}},
    {"start_date": {"year": "2023", "month": "4"},
    "text": {"headline": "Survey Generation API Erroring Out",
    "text": "<p>After the correction the prior month an issue was reported which was occuring less frequently.  In diving into one of the data warehouse environments I located a table which was zeroing out inventory every so often.  I reported this to the DW team who promptly fixed the issue. <p>"}},
    {"start_date": {"year": "2023", "month": "1"},
    "text": {"headline": "Call Center BI Developer Hired!",
    "text": "<p>Spent several months onboarding the new Call Center BI Developer. <p>"}},
    {"start_date": {"year": "2022", "month": "4"},
    "text": {"headline": "Recurring Inventory Reporting Issue continued..",
    "text": "<p>After the correction the prior month an issue was reported which was occuring less frequently.  In diving into one of the data warehouse environments I located a table which was zeroing out inventory every so often.  I reported this to the DW team who promptly fixed the issue. <p>"}},
    {"start_date": {"year": "2022", "month": "3"},
    "text": {"headline": "Recurring Inventory Reporting Issue",
    "text": "<p>After weeks of going back and forth with end users and the data warehouse on an inventory reporting issue, I was finally able to step through the workflow with the data warehouse team.  I then spoke with the DB2 Application Development team and uncovered that there is a trunc and reload on DB2 which was sometimes overlapping with the data warehouse load creating inconsistent data for the reports.  We changed the timing of the data warehouse loads which corrected the issue. <p>"}},
    {"start_date": {"year": "2021", "month": "4"},
    "text": {"headline": "Upgrade Teleform Software",
    "text": "<p>Project manager and onsite SME for upgrading Teleform to v20.3. <p>"}},
    {"start_date": {"year": "2021", "month": "3"},
    "text": {"headline": "Expanding Data Responsibilities",
    "text": "<p>Our team was shrinking and one other teammate and I were left to share the learning and support of reporting for Sales and Email & Web (marketing). Additionally, I took on the role to support the call center reporting suite until a new BI Developer could be hired to take it over. <p>"}},
    {"start_date": {"year": "2020", "month": "7"},
    "text": {"headline": "Annual Post Trip Excellence Projects - Creation of detailed Documentation",
    "text": "<p>Annual and biannual projects were run for the creation of new survey versions. Additionally, source data needed to be loaded and new annual reports needed to be developed and ready for viewing in the new year. I was responsible for this work and decided to document it in its entirety. <p>"}},
    {"start_date": {"year": "2020", "month": "6"},
    "text": {"headline": "SSRS Skills Needed",
    "text": "<p>Throughout my time on the BI team we were slowly working through migrating all reporting from Hyperion to Tableau and SSRS. There were excellence reports that needed to be converted to SSRS but I had no experience. I started the journey by watching YouTube videos, then dissecting existing SSRS reports, and from there was able to start my own report development in SSRS. <p>"}},
    {"start_date": {"year": "2019", "month": "4"},
    "text": {"headline": "Incentive Reporting Overhaul",
    "text": "<p>The incentive report consisted of ~7 steps/queries that needed to be run in sequence in Hyperion. I needed to move this process out of Hyperion, so I created a complex Alteryx workflow which combined data from several sources, and had business incentive specific logic built in; this workflow would write to temporary tables allowing for multiple runs and data reviews by the business, then a final run to the production table. A Tableau workbook was created over these new tables. <p>"}},
    {"start_date": {"year": "2019", "month": "3"},
    "text": {"headline": "Survey Data and Process Workflow",
    "text": "<p>Identified a need for a source to target workflow identifying processes and data passage from the source DB2 to the target Data Warehouse (and surveys to customers.) This workflow would become an important tool in assisting IT members in understanding the full Survey flow. <p>"}},
    {"start_date": {"year": "2017", "month": "10"},
    "text": {"headline": "Teleform Server and Desktops Hardware and Software Upgrade",
    "text": "<p>Project manager and onsite SME, working with CSS, for an upgrade project which entailed new server and desktop hardware Teleform; as well as software upgrade. <p>"}},
    {"start_date": {"year": "2017", "month": "4"},
    "text": {"headline": "The Big Book of Dashboards",
    "text": "<p>Attended a workshop in Boston with Steve Wexler co-author of The Big Book of Dashboards.<p>"}},
    {"start_date": {"year": "2016", "month": "9"},
    "text": {"headline": "Vetted and Signed Contract with CSS", 
    "text": "<p>Soley responsible for vetting vendors for the maintenance and support of the paper survey software, Teleform.<p>"}},
    {"start_date": {"year": "2016", "month": "4"},
    "text": {"headline": "Introduction to/Implementation of Alteryx", 
    "text": "<p>Introduction to Alteryx, a data blending and advanced analytics software.  I would use this software to blend data from multiple sources, incorporate complex business logic, and create new data sources for Tableau.<p>"}},
    {"start_date": {"year": "2015", "month": "11"},
    "text":{"headline":"Tableau Desktop I Fundamentals",
    "text":"<p>Official Tableau training to fill in the gaps.<p>"}},
    {"start_date": {"year": "2015", "month": "10"},
    "text": {"headline": "Excellence/Survey Data SME",
    "text": "<p>Focus for the next couple of years was on learning and supporting the excellence data model; Hyperion, Tableau, and SSRS reporting; Teleform paper and Qualtrics online Survey development.<p>"}},
    {"start_date":{"year":"2015","month":"9"},
    "text":{"headline":"Senior Business Intelligence Developer",
    "text":"<p>In 2015, I joined the BI team and deepened my appreciation for data and reporting.<p>"}}
        
    ]}